InformationRegisters/МаркируемыеТоварыВЗаказеКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>МаркируемыеТоварыВЗаказеКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МаркируемыеТоварыВЗаказеКлиента/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаказКлиента") Тогда
		
		ЗаказКлиента = Параметры.ЗаказКлиента;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЗаказКлиента", ЗаказКлиента, ВидСравненияКомпоновкиДанных.Равно);

	КонецЕсли;
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр).Штрихкод;
			
			//Структура = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(Штрихкод);
			
			Структура = РазборКодаМаркировкиИССлужебныйКлиент.РазобратьКодМаркировки(Штрихкод);
			
			//ЗначениеШтрихкода = СтрШаблон("(01)%1(21)%2", Структура.СоставКодаМаркировки.GTIN , Структура.СоставКодаМаркировки.СерийныйНомер);
			
			ЗначениеШтрихкода = Структура.НормализованныйКодМаркировки;
			
			ДобавитьЗапись(ЗначениеШтрихкода);
			
			Элементы.Список.Обновить();
			
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);

КонецПроцедуры

Процедура ДобавитьЗапись(Штрихкод)
	
	ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", Штрихкод);
	Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
		
		НоваяЗапись = РегистрыСведений.МаркируемыеТоварыВЗаказеКлиента.СоздатьМенеджерЗаписи();
		НоваяЗапись.ЗаказКлиента = ЗаказКлиента;
		НоваяЗапись.Номенклатура = ШтрихкодУпаковки.Номенклатура;
		НоваяЗапись.Характеристика = ШтрихкодУпаковки.Характеристика;
		НоваяЗапись.ШтрихкодУпаковки = ШтрихкодУпаковки;
		
		НоваяЗапись.Записать();
		
	Иначе
		Сообщить("Штрихкод не найден.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБезСканера(Команда)
	
	ОткрытьФорму("РегистрСведений.МаркируемыеТоварыВЗаказеКлиента.Форма.ФормаЗаписи", Новый Структура("ЗаказКлиента", ЗаказКлиента));
	
КонецПроцедуры
